apache/nuttx/arch/arm/src/stm32/stm32_otghshost.c
      if ((pending & OTGHS_GINT_NPTXFE) != 0)
        {
          usbhost_vtrace1(OTGHS_VTRACE1_GINT_NPTXFE, 0);
          stm32_gint_nptxfeisr(priv);
        }

      /* Handle the periodic TxFIFO empty interrupt */

      if ((pending & OTGHS_GINT_PTXFE) != 0)
        {
          usbhost_vtrace1(OTGHS_VTRACE1_GINT_PTXFE, 0);
          stm32_gint_ptxfeisr(priv);
        }

      /* Handle the host channels interrupt */

      if ((pending & OTGHS_GINT_HC) != 0)
        {
          usbhost_vtrace1(OTGHS_VTRACE1_GINT_HC, 0);
          stm32_gint_hcisr(priv);
        }

      /* Handle the host port interrupt */

      if ((pending & OTGHS_GINT_HPRT) != 0)
        {
          stm32_gint_hprtisr(priv);
        }

      /* Handle the disconnect detected interrupt */

      if ((pending & OTGHS_GINT_DISC) != 0)
        {
          usbhost_vtrace1(OTGHS_VTRACE1_GINT_DISC, 0);
          stm32_gint_discisr(priv);
        }

      /* Handle the incomplete periodic transfer */

      if ((pending & OTGHS_GINT_IPXFR) != 0)
        {
          usbhost_vtrace1(OTGHS_VTRACE1_GINT_IPXFR, 0);
          stm32_gint_ipxfrisr(priv);
        }
    }

  /* We won't get here */

  return OK;
}

/****************************************************************************
 * Name: stm32_gint_enable and stm32_gint_disable
 *
 * Description:
 *   Respectively enable or disable the global OTG HS interrupt.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static void stm32_gint_enable(void)
{
  uint32_t regval;

  /* Set the GINTMSK bit to unmask the interrupt */

  regval  = stm32_getreg(STM32_OTGHS_GAHBCFG);
  regval |= OTGHS_GAHBCFG_GINTMSK;
  stm32_putreg(STM32_OTGHS_GAHBCFG, regval);
}

static void stm32_gint_disable(void)
{
  uint32_t regval;

  /* Clear the GINTMSK bit to mask the interrupt */

  regval  = stm32_getreg(STM32_OTGHS_GAHBCFG);
  regval &= ~OTGHS_GAHBCFG_GINTMSK;
  stm32_putreg(STM32_OTGHS_GAHBCFG, regval);
}

/****************************************************************************
 * Name: stm32_hostinit_enable
 *
 * Description:
 *   Enable host interrupts.
 *
 * Input Parameters:
 *   None
 *
 * Returned Value:
 *   None
 *
 ****************************************************************************/

static inline void stm32_hostinit_enable(void)
{
  uint32_t regval;

  /* Disable all interrupts. */

  stm32_putreg(STM32_OTGHS_GINTMSK, 0);

  /* Clear any pending interrupts. */

  stm32_putreg(STM32_OTGHS_GINTSTS, 0xffffffff);

  /* Clear any pending USB OTG Interrupts */

  stm32_putreg(STM32_OTGHS_GOTGINT, 0xffffffff);

  /* Clear any pending USB OTG interrupts */

  stm32_putreg(STM32_OTGHS_GINTSTS, 0xbfffffff);

  /* Enable the host interrupts */

  /* Common interrupts:
   *
   *   OTGHS_GINT_WKUP     : Resume/remote wakeup detected interrupt
   *   OTGHS_GINT_USBSUSP  : USB suspend
   */

  regval = (OTGHS_GINT_WKUP | OTGHS_GINT_USBSUSP);

  /* If OTG were supported, we would need to enable the following as well:
   *
   *   OTGHS_GINT_OTG      : OTG interrupt
   *   OTGHS_GINT_SRQ      : Session request/new session detected interrupt
   *   OTGHS_GINT_CIDSCHG  : Connector ID status change
   */

  /* Host-specific interrupts
   *
   *   OTGHS_GINT_SOF      : Start of frame
   *   OTGHS_GINT_RXFLVL   : RxFIFO non-empty
   *   OTGHS_GINT_IISOOXFR : Incomplete isochronous OUT transfer
   *   OTGHS_GINT_HPRT     : Host port interrupt
   *   OTGHS_GINT_HC       : Host channels interrupt
   *   OTGHS_GINT_DISC     : Disconnect detected interrupt
   */

#ifdef CONFIG_STM32_OTGHS_SOFINTR
  regval |= (OTGHS_GINT_SOF    | OTGHS_GINT_RXFLVL   | OTGHS_GINT_IISOOXFR |
             OTGHS_GINT_HPRT   | OTGHS_GINT_HC       | OTGHS_GINT_DISC);
#else
  regval |= (OTGHS_GINT_RXFLVL | OTGHS_GINT_IPXFR    | OTGHS_GINT_HPRT     |
             OTGHS_GINT_HC     | OTGHS_GINT_DISC);
#endif
  stm32_putreg(STM32_OTGHS_GINTMSK, regval);
}

/****************************************************************************
 * Name: stm32_txfe_enable
 *
 * Description:
 *   Enable Tx FIFO empty interrupts.  This is necessary when the entire
 *   transfer will not fit into Tx FIFO.  The transfer will then be completed
 *   when the Tx FIFO is empty.  NOTE:  The Tx FIFO interrupt is disabled
 *   the fifo empty interrupt handler when the transfer is complete.
 *
 * Input Parameters:
 *   priv - Driver state structure reference
 *   chidx - The channel that requires the Tx FIFO empty interrupt
 *
 * Returned Value:
 *   None
 *
 * Assumptions:
 *   Called from user task context.  Interrupts must be disabled to assure
 *   exclusive access to the GINTMSK register.
 *
 ****************************************************************************/

static void stm32_txfe_enable(struct stm32_usbhost_s *priv, int chidx)
{
  struct stm32_chan_s *chan = &priv->chan[chidx];
  irqstate_t flags;
  uint32_t regval;

  /* Disable all interrupts so that we have exclusive access to the GINTMSK
   * (it would be sufficient just to disable the GINT interrupt).
   */

  flags = enter_critical_section();

  /* Should we enable the periodic or non-peridic Tx FIFO empty interrupts */

  regval = stm32_getreg(STM32_OTGHS_GINTMSK);
  switch (chan->eptype)
    {
    default:
    case OTGHS_EPTYPE_CTRL: /* Non periodic transfer */
    case OTGHS_EPTYPE_BULK:
      regval |= OTGHS_GINT_NPTXFE;
      break;

    case OTGHS_EPTYPE_INTR: /* Periodic transfer */
    case OTGHS_EPTYPE_ISOC:
      regval |= OTGHS_GINT_PTXFE;
      break;
    }

  /* Enable interrupts */

  stm32_putreg(STM32_OTGHS_GINTMSK, regval);
  leave_critical_section(flags);
}

/****************************************************************************
 * USB Host Controller Operations
 ****************************************************************************/

/****************************************************************************
 * Name: stm32_wait
 *
 * Description:
 *   Wait for a device to be connected or disconnected to/from a hub port.
 *
 * Input Parameters:
 *   conn - The USB host connection instance obtained as a parameter from
 *     the call to the USB driver initialization logic.
 *   hport - The location to return the hub port descriptor that detected
 *     the connection related event.
 *
 * Returned Value:
 *   Zero (OK) is returned on success when a device is connected or
 *   disconnected. This function will not return until either (1) a device is
 *   connected or disconnect to/from any hub port or until (2) some failure
 *   occurs.  On a failure, a negated errno value is returned indicating the
 *   nature of the failure
 *
 * Assumptions:
 *   - Called from a single thread so no mutual exclusion is required.
 *   - Never called from an interrupt handler.
 *
 ****************************************************************************/

