apache/nuttx/arch/arm/src/stm32/stm32_otghshost.c
  up_mdelay(20);

  regval &= ~OTGHS_HPRT_PRST;
  stm32_putreg(STM32_OTGHS_HPRT, regval);

  up_mdelay(20);
}

/****************************************************************************
 * Name: stm32_flush_txfifos
 *
 * Description:
 *   Flush the selected Tx FIFO.
 *
 * Input Parameters:
 *   txfnum -- USB host driver private data structure.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void stm32_flush_txfifos(uint32_t txfnum)
{
  uint32_t regval;
  uint32_t timeout;

  /* Initiate the TX FIFO flush operation */

  regval = OTGHS_GRSTCTL_TXFFLSH | txfnum;
  stm32_putreg(STM32_OTGHS_GRSTCTL, regval);

  /* Wait for the FLUSH to complete */

  for (timeout = 0; timeout < STM32_FLUSH_DELAY; timeout++)
    {
      regval = stm32_getreg(STM32_OTGHS_GRSTCTL);
      if ((regval & OTGHS_GRSTCTL_TXFFLSH) == 0)
        {
          break;
        }
    }

  /* Wait for 3 PHY Clocks */

  up_udelay(3);
}

/****************************************************************************
 * Name: stm32_flush_rxfifo
 *
 * Description:
 *   Flush the Rx FIFO.
 *
 * Input Parameters:
 *   priv -- USB host driver private data structure.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void stm32_flush_rxfifo(void)
{
  uint32_t regval;
  uint32_t timeout;

  /* Initiate the RX FIFO flush operation */

  stm32_putreg(STM32_OTGHS_GRSTCTL, OTGHS_GRSTCTL_RXFFLSH);

  /* Wait for the FLUSH to complete */

  for (timeout = 0; timeout < STM32_FLUSH_DELAY; timeout++)
    {
      regval = stm32_getreg(STM32_OTGHS_GRSTCTL);
      if ((regval & OTGHS_GRSTCTL_RXFFLSH) == 0)
        {
          break;
        }
    }

  /* Wait for 3 PHY Clocks */

  up_udelay(3);
}

/****************************************************************************
 * Name: stm32_vbusdrive
 *
 * Description:
 *   Drive the Vbus +5V.
 *
 * Input Parameters:
 *   priv  - USB host driver private data structure.
 *   state - True: Drive, False: Don't drive
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void stm32_vbusdrive(struct stm32_usbhost_s *priv, bool state)
{
  uint32_t regval;

  /* Enable/disable the external charge pump */

  stm32_usbhost_vbusdrive(0, state);

  /* Turn on the Host port power. */

  regval = stm32_getreg(STM32_OTGHS_HPRT);
  regval &= ~(OTGHS_HPRT_PENA | OTGHS_HPRT_PCDET | OTGHS_HPRT_PENCHNG |
              OTGHS_HPRT_POCCHNG);

  if (((regval & OTGHS_HPRT_PPWR) == 0) && state)
    {
      regval |= OTGHS_HPRT_PPWR;
      stm32_putreg(STM32_OTGHS_HPRT, regval);
    }

  if (((regval & OTGHS_HPRT_PPWR) != 0) && !state)
    {
      regval &= ~OTGHS_HPRT_PPWR;
      stm32_putreg(STM32_OTGHS_HPRT, regval);
    }

  up_mdelay(200);
}

/****************************************************************************
 * Name: stm32_host_initialize
 *
 * Description:
 *   Initialize/re-initialize hardware for host mode operation.  At present,
 *   this function is called only from stm32_hw_initialize().  But if OTG
 *   mode were supported, this function would also be called to switch
 *   between host and device modes on a connector ID change interrupt.
 *
 * Input Parameters:
 *   priv -- USB host driver private data structure.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static void stm32_host_initialize(struct stm32_usbhost_s *priv)
{
  uint32_t regval;
  uint32_t offset;
  int i;

  /* Restart the PHY Clock */

  stm32_putreg(STM32_OTGHS_PCGCCTL, 0);

  /* Initialize Host Configuration (HCFG) register */

  regval  = stm32_getreg(STM32_OTGHS_HCFG);
  regval &= ~OTGHS_HCFG_FSLSPCS_MASK;
  regval |= OTGHS_HCFG_FSLSPCS_FS48MHz;
  stm32_putreg(STM32_OTGHS_HCFG, regval);

  /* Reset the host port */

  stm32_portreset(priv);

  /* Clear the HS-/LS-only support bit in the HCFG register */

  regval = stm32_getreg(STM32_OTGHS_HCFG);
  regval &= ~OTGHS_HCFG_FSLSS;
  stm32_putreg(STM32_OTGHS_HCFG, regval);

  /* Carve up FIFO memory for the Rx FIFO and the periodic and non-periodic
   * Tx FIFOs
   */

  /* Configure Rx FIFO size (GRXHSIZ) */

  stm32_putreg(STM32_OTGHS_GRXFSIZ, CONFIG_STM32_OTGHS_RXFIFO_SIZE);
  offset = CONFIG_STM32_OTGHS_RXFIFO_SIZE;

  /* Setup the host non-periodic Tx FIFO size (HNPTXHSIZ) */

  regval  = (offset |
             (CONFIG_STM32_OTGHS_NPTXFIFO_SIZE <<
             OTGHS_HNPTXFSIZ_NPTXFD_SHIFT));
  stm32_putreg(STM32_OTGHS_HNPTXFSIZ, regval);
  offset += CONFIG_STM32_OTGHS_NPTXFIFO_SIZE;

  /* Set up the host periodic Tx fifo size register (HPTXHSIZ) */

  regval  = (offset |
             (CONFIG_STM32_OTGHS_PTXFIFO_SIZE <<
             OTGHS_HPTXFSIZ_PTXFD_SHIFT));
  stm32_putreg(STM32_OTGHS_HPTXFSIZ, regval);

  /* If OTG were supported, we should need to clear HNP enable bit in the
   * USB_OTG control register about here.
   */

  /* Flush all FIFOs */

  stm32_flush_txfifos(OTGHS_GRSTCTL_TXFNUM_HALL);
  stm32_flush_rxfifo();

  /* Clear all pending HC Interrupts */

  for (i = 0; i < STM32_NHOST_CHANNELS; i++)
    {
      stm32_putreg(STM32_OTGHS_HCINT(i), 0xffffffff);
      stm32_putreg(STM32_OTGHS_HCINTMSK(i), 0);
    }

  /* Driver Vbus +5V (the smoke test).  Should be done elsewhere in OTG
   * mode.
   */

  stm32_vbusdrive(priv, true);

  /* Enable host interrupts */

  stm32_hostinit_enable();
}

/****************************************************************************
 * Name: stm32_sw_initialize
 *
 * Description:
 *   One-time setup of the host driver state structure.
 *
 * Input Parameters:
 *   priv -- USB host driver private data structure.
 *
 * Returned Value:
 *   None.
 *
 ****************************************************************************/

static inline void stm32_sw_initialize(struct stm32_usbhost_s *priv)
{
  struct usbhost_driver_s *drvr;
  struct usbhost_hubport_s *hport;
  int i;

  /* Initialize the device operations */

  drvr                 = &priv->drvr;
  drvr->ep0configure   = stm32_ep0configure;
  drvr->epalloc        = stm32_epalloc;
  drvr->epfree         = stm32_epfree;
  drvr->alloc          = stm32_alloc;
  drvr->free           = stm32_free;
  drvr->ioalloc        = stm32_ioalloc;
  drvr->iofree         = stm32_iofree;
  drvr->ctrlin         = stm32_ctrlin;
  drvr->ctrlout        = stm32_ctrlout;
  drvr->transfer       = stm32_transfer;
#ifdef CONFIG_USBHOST_ASYNCH
  drvr->asynch         = stm32_asynch;
#endif
  drvr->cancel         = stm32_cancel;
#ifdef CONFIG_USBHOST_HUB
  drvr->connect        = stm32_connect;
#endif
  drvr->disconnect     = stm32_disconnect;

